/* No comment provided by engineer. */
"%@ requires %d item on stack." = "%1$@ requires %2$d item on stack.";

/* No comment provided by engineer. */
"%@ requires %d items on stack." = "%1$@ requires %2$d items on stack.";

/* No comment provided by engineer. */
"%@ requires one item on altstack" = "%@ requires one item on altstack";

/* Error description */
"Alignment Error" = "Alignment Error";

/* No comment provided by engineer. */
"Already have block %@" = "Already have block %@";

/* No comment provided by engineer. */
"Already have orphan block %@" = "Already have orphan block %@";

/* No comment provided by engineer. */
"Attempt to execute a disabled opcode." = "Attempt to execute a disabled opcode.";

/* Error description */
"Buffer Too Small" = "Buffer Too Small";

/* No comment provided by engineer. */
"Condition branches not balanced." = "Condition branches not balanced.";

/* Error description */
"Decode Error" = "Decode Error";

/* No comment provided by engineer. */
"Exceeded allowed number of operations per script." = "Exceeded allowed number of operations per script.";

/* No comment provided by engineer. */
"Exceeded the allowed number of operations per script." = "Exceeded the allowed number of operations per script.";

/* No comment provided by engineer. */
"Expected an OP_IF or OP_NOTIF branch before OP_ELSE." = "Expected an OP_IF or OP_NOTIF branch before OP_ELSE.";

/* No comment provided by engineer. */
"Expected an OP_IF or OP_NOTIF branch before OP_ENDIF." = "Expected an OP_IF or OP_NOTIF branch before OP_ENDIF.";

/* Error reason */
"Failed to allocate memory" = "Failed to allocate memory";

/* Error reason */
"Function not implemented for the current algorithm" = "Function not implemented for the current algorithm";

/* Error reason */
"Illegal parameter supplied to encryption/decryption algorithm" = "Illegal parameter supplied to encryption/decryption algorithm";

/* Error reason */
"Input data did not decode or decrypt correctly" = "Input data did not decode or decrypt correctly";

/* No comment provided by engineer. */
"Input index is out of bounds for transaction: %d >= %d." = "Input index is out of bounds for transaction: %1$d >= %2$d.";

/* No comment provided by engineer. */
"Input script for P2SH spending must be literals-only." = "Input script for P2SH spending must be literals-only.";

/* Error reason */
"Input size to encryption algorithm was not aligned correctly" = "Input size to encryption algorithm was not aligned correctly";

/* Error reason */
"Insufficient buffer provided for specified operation" = "Insufficient buffer provided for specified operation";

/* No comment provided by engineer. */
"Invalid bignum data." = "Invalid bignum data.";

/* No comment provided by engineer. */
"Invalid number of items for %@: %d." = "Invalid number of items for %1$@: %2$d.";

/* No comment provided by engineer. */
"Invalid number of keys for %@: %d." = "Invalid number of keys for %1$@: %2$d.";

/* No comment provided by engineer. */
"Invalid number of signatures for %@: %d." = "Invalid number of signatures for %1$@: %2$d.";

/* No comment provided by engineer. */
"Last item on the stack is boolean NO." = "Last item on the stack is boolean NO.";

/* Error description */
"Memory Failure" = "Memory Failure";

/* No comment provided by engineer. */
"Multisignature check failed. %@" = "Multisignature check failed. %@";

/* No comment provided by engineer. */
"Non-canonical public key: length of compressed key must be 33 bytes." = "Non-canonical public key: length of compressed key must be 33 bytes.";

/* No comment provided by engineer. */
"Non-canonical public key: length of uncompressed key must be 65 bytes." = "Non-canonical public key: length of uncompressed key must be 65 bytes.";

/* No comment provided by engineer. */
"Non-canonical public key: too short." = "Non-canonical public key: too short.";

/* No comment provided by engineer. */
"Non-canonical signature: R length is zero" = "Non-canonical signature: R length is zero";

/* No comment provided by engineer. */
"Non-canonical signature: R value excessively padded" = "Non-canonical signature: R value excessively padded";

/* No comment provided by engineer. */
"Non-canonical signature: R value negative" = "Non-canonical signature: R value negative";

/* No comment provided by engineer. */
"Non-canonical signature: R value type mismatch" = "Non-canonical signature: R value type mismatch";

/* No comment provided by engineer. */
"Non-canonical signature: R+S length mismatch" = "Non-canonical signature: R+S length mismatch";

/* No comment provided by engineer. */
"Non-canonical signature: S length is zero" = "Non-canonical signature: S length is zero";

/* No comment provided by engineer. */
"Non-canonical signature: S length misplaced." = "Non-canonical signature: S length misplaced.";

/* No comment provided by engineer. */
"Non-canonical signature: S value excessively padded" = "Non-canonical signature: S value excessively padded";

/* No comment provided by engineer. */
"Non-canonical signature: S value is negative" = "Non-canonical signature: S value is negative";

/* No comment provided by engineer. */
"Non-canonical signature: S value is unnecessarily high" = "Non-canonical signature: S value is unnecessarily high";

/* No comment provided by engineer. */
"Non-canonical signature: S value type mismatch" = "Non-canonical signature: S value type mismatch";

/* No comment provided by engineer. */
"Non-canonical signature: too long." = "Non-canonical signature: too long.";

/* No comment provided by engineer. */
"Non-canonical signature: too short." = "Non-canonical signature: too short.";

/* No comment provided by engineer. */
"Non-canonical signature: unknown hashtype byte." = "Non-canonical signature: unknown hashtype byte.";

/* No comment provided by engineer. */
"Non-canonical signature: wrong length marker." = "Non-canonical signature: wrong length marker.";

/* No comment provided by engineer. */
"Non-canonical signature: wrong type." = "Non-canonical signature: wrong type.";

/* No comment provided by engineer. */
"OP_EQUALVERIFY failed." = "OP_EQUALVERIFY failed.";

/* No comment provided by engineer. */
"OP_NUMEQUALVERIFY failed." = "OP_NUMEQUALVERIFY failed.";

/* No comment provided by engineer. */
"OP_RETURN executed." = "OP_RETURN executed.";

/* No comment provided by engineer. */
"OP_VERIFY failed." = "OP_VERIFY failed.";

/* Error description */
"Parameter Error" = "Parameter Error";

/* No comment provided by engineer. */
"Public key is not valid: %@." = "Public key is not valid: %@.";

/* No comment provided by engineer. */
"Pushdata chunk size is too big." = "Pushdata chunk size is too big.";

/* No comment provided by engineer. */
"Script binary is too long." = "Script binary is too long.";

/* No comment provided by engineer. */
"Signature check failed. %@" = "Signature check failed. %@";

/* No comment provided by engineer. */
"Signature is empty." = "Signature is empty.";

/* No comment provided by engineer. */
"Signature is not valid." = "Signature is not valid.";

/* No comment provided by engineer. */
"Stack is empty after script execution." = "Stack is empty after script execution.";

/* Error description */
"Success" = "Success";

/* No comment provided by engineer. */
"Transaction and valid input index must be provided for signature verification." = "Transaction and valid input index must be provided for signature verification.";

/* Error description */
"Unimplemented Function" = "Unimplemented Function";

/* Error description */
"Unknown Error" = "Unknown Error";

/* No comment provided by engineer. */
"Unknown non-canonical public key." = "Unknown non-canonical public key.";

/* No comment provided by engineer. */
"Unknown opcode %d (%@)." = "Unknown opcode %1$d (%2$@).";

/* No comment provided by engineer. */
"保存失败" = "保存失败";

/* No comment provided by engineer. */
"保存成功" = "保存成功";

/* No comment provided by engineer. */
"字符串%@" = "字符串%@";

/* No comment provided by engineer. */
"文件不存在！" = "文件不存在！";

/* No comment provided by engineer. */
"暂无缓存,您无需清理~" = "暂无缓存,您无需清理~";

/* No comment provided by engineer. */
"输入颜色数量过多，如果需求数量过大，请修改locations[]数组的个数" = "输入颜色数量过多，如果需求数量过大，请修改locations[]数组的个数";

